# 练习案例:常用功能练习
#
# 有一个列表，内容是: [21, 25, 21, 23, 22, 20]，记录的是一批学生的年龄
#
# 请通过列表的功能（方法），对其进行
#
# 1. 定义这个列表，并用变量接收它
# 2. 追加一个数字31，到列表的尾部
# 3. 追加一个新列表[29, 33, 30]，到列表的尾部
# 4. 取出第一个元素（应是：21）
# 5. 取出最后一个元素（应是：30）
# 6. 查找元素31，在列表中的下标位置

# 定义列表
my_list = [21, 25, 21, 23, 22, 20]
print(f"原始列表是{my_list}")

# 追加一个数字 31, 到列表尾部
my_list.append(31)
print(f"追加一个数字,31之后的列表是{my_list}")

# 在追加一个 [29, 33, 30]的列表到 my_list的尾部
my_list.extend([29, 33, 30])
print(f"追加一个 [29, 33, 30]的列表后{my_list}")

# 取出第一个元素
s1 = my_list[0]
print (f"取出第一个元素{s1}")

# 取出最后一个元素
s2 = my_list[-1]
print(f"取出最后一个元素{s2}")

# 查找元素31在列表的位置
index = my_list.index(31)
print(f"元素31在列表的中的下标位置是{index}")