# ---------------------------------- 函数 - 传参方式 ----------------------------------

# 定义函数
def reg_stu(name, age, gender, city , jieju):
    print(f"列入成功，姓名: {name}, 年龄: {age}, 性别: {gender}, 城市: {city}, 结局: {jieju}")
    return {"name": name, "age": age, "gender": gender, "city": city, "aihao": jieju}

# 传参方式一：位置参数
# 按照函数定义时参数的顺序依次传递，数量和顺序必须一一对应
s1 = reg_stu("刘华强", 30, "男", "河北" , "劈瓜")
print(s1)
# 传参方式二：关键字参数
# 通过“键=值”的形式传递，不需要遵循顺序，但参数名必须与函数定义一致
s2 = reg_stu(name="郝哥", age=35, gender="男", city="河北", jieju = "挨劈")
print(s2)
# 传参方式三：位置参数 + 关键字参数
# 位置参数必须写在关键字参数前面
s3 = reg_stu("振涛", 20, gender="男", city="河北",jieju="被捅")
print(s3)

# 1. 位置参数
# 调用函数时，传入的实参的顺序与定义函数时形参的顺序完全一致。
#
# 2. 关键字参数
# 调用函数时，通过 "形参名=值" 的形式传递参数，顺序没有要求。
# 如果同时存在位置参数与关键字参数，位置参数在前，关键字参数在后。
#
# 3. 两种传参方式的适用场景
# 一切以代码结构清晰明了（可读性）、便于维护（维护性）为目标。
# 如果参数比较少（不超过3个），可直接使用位置参数。
# 如果参数数量较多，建议使用关键字参数.
