"""
算术运算符
+ , - , * , / , //  , % , **
加 , 减 , 乘  除 , 整除 , 取于-求模 , 幂指数次方

"""

# 示列
print("10 + 4 = " , 10 + 4) # 16
print("10 - 4 = " , 10 - 4) # 6
print("10 * 4 = " , 10 * 4) # 40
print("10 / 4 = " ,10 / 4) # 2.5
print("10 // 4 = " , 10 // 4) # 2
print("10 % 4 = " , 10 % 4) # 2
print("10 ** 4 = " , 10 ** 4) # 10000


# 作业
# 案例 1:计算输入的三个整数的平均数
# 案例 2:要求输入梯形的上底、下底、高,然后计算梯形的面积
# 案例 3:要求输入园的半径,然后计算园的周长和面积(周长:2πr,面积:π2)
# 案例 4:身体质量指数 BMI 的计算(BMI = 体重(kg) /身高(m)2)
# 1•输入体重(单位 kg)
# 2•输入身高(单位 m)
# 3.计算身体质量指数 BMI 并输出

# 案列 1
print("案例 1:计算输入的三个整数的平均数")
print("---------")
s1 = int(input("请输入第一个数: "))
s2 = int(input("请输入第二个数: "))
s3 = int(input("请输入第三个数: "))
print(f"这三个数的平均数是: {(s1 + s2 + s3) / 3}")

# 案列 2
print("案例 2:要求输入梯形的上底、下底、高,然后计算梯形的面积")
print("---------")
shangdi = int(input("请输入梯形的上底: "))
xiadi = int(input("请输入梯形的下底: "))
gao = int(input("请输入梯形的高: "))
print(f"梯形的面积是: {(shangdi + xiadi) * gao / 2}")

# 案列 3
print("案例 3:要求输入园的半径,然后计算园的周长和面积(周长:2πr,面积:π2)")
print("---------")
banjing = int(input("请输入圆的半径: "))
print(f"圆的周长是 {2 * 3.14 * banjing},圆的面积是: {3.14 * banjing * banjing} ")

# 案列 4
print("""
# 案例 4:身体质量指数 BMI 的计算(BMI = 体重(kg) /身高(m)2)
# 1•输入体重(单位 kg)
# 2•输入身高(单位 m)
# 3.计算身体质量指数 BMI 并输出""")
print("---------")
tizhong = int(input("你的体重是: "))
shengao = float(input("你的身高是: "))
print(f"你的体重是: {tizhong} KG ")
print(f"你的身高是: {shengao} m ")
print(f"你的身体质量指数是: {tizhong / (shengao * shengao)} BMI ")